{
    "job-description-1": "<ul><li>In my time at Andela, I have developed, optimized and secured APIs in Python as well as implemented data security and storage for one of Andela's internal tools.</li><li>I wrote test cases for the code that improved code coverage by 90%.</li><li>I also worked with the engineering teams of Andela's partner companies, such as 2U, as a full-time, remote software engineer.</li></ul><br><strong>Technologies Used: </strong>Python (Django and Flask), PHP and Angular 2",
    "job-description-2": "<ul><li>Collaborated with one of 2U's engineering teams to integrate, deliver and maintain their suite of applications for new university programs</li><li> Improved the program standup process that includes deployments and data integration.</li><li>Achieved an 80% turnaround efficiency for 2U in the final quarter of 2019 as a team.</li></ul>",
    "job-description-3": "<ul><li>Lowered AWS service costs by 85% by leveraging free-tier instances and the AWS Calculator to compare estimates between regions.</li><li>Developed web-based platforms using full-stack Django, Flask and bootstrap.</li><li>Designed high-level architecture and entity-relationship diagrams for the components and database.</li><li>Implement and maintain deployment scripts in python to build and deploy code to both staging and production.</li><li>Created and maintained a CI/CD pipeline on bitbucket that deploys to Elastic Beanstalk environments on AWS.</li><li>Utilize and maintain EC2 instances on AWS with auto-scaling, as the deployment servers for production and staging.</li><li>Setup an Application Load Balancer for the EC2 instances and linked it with Cloudfront.</li><li>Implemented and maintained RDS instances for the MySQL database.</li><li>Setup a deployment pipeline for a frontend React app with AWS Amplify.</li><li>Use JIRA as the project management tool and Bitbucket for version control, following agile principles in development.</li></ul><br><strong>Technologies Used: </strong>Python Django, Flask, Bootstrap and AWS."

}