{
    "view-on-github": "<span class='view-on-github'>View on GitHub </span><svg version='1.1' width='16' height='16' viewBox='0 0 16 16' class='octicon octicon-mark-github' aria-hidden='true'><path fill-rule='evenodd' d='M8 0C3.58 0 0 3.58 0 8c0 3.54 2.29 6.53 5.47 7.59.4.07.55-.17.55-.38 0-.19-.01-.82-.01-1.49-2.01.37-2.53-.49-2.69-.94-.09-.23-.48-.94-.82-1.13-.28-.15-.68-.52-.01-.53.63-.01 1.08.58 1.23.82.72 1.21 1.87.87 2.33.66.07-.52.28-.87.51-1.07-1.78-.2-3.64-.89-3.64-3.95 0-.87.31-1.59.82-2.15-.08-.2-.36-1.02.08-2.12 0 0 .67-.21 2.2.82.64-.18 1.32-.27 2-.27.68 0 1.36.09 2 .27 1.53-1.04 2.2-.82 2.2-.82.44 1.1.16 1.92.08 2.12.51.56.82 1.27.82 2.15 0 3.07-1.87 3.75-3.65 3.95.29.25.54.73.54 1.48 0 1.07-.01 1.93-.01 2.2 0 .21.15.46.55.38A8.013 8.013 0 0 0 16 8c0-4.42-3.58-8-8-8z'></path></svg>",
    "first-project-title": "<strong>Data Engineering Capstone Project</strong>",
    "first-project-text": "In this project, I worked on building an ETL pipeline that will be able to provide information to data analysts, immigration and climate researchers e.tc with temperature, population and immigration statistics for different cities. It does this by first extracting temperature, airport, immigration and demographic data from various datasets, perform some transformation on it and convert the data into json files using Apache Spark that can be then uploaded to a Redshift database. Using Apache Airflow, the json files get migrated to s3, then the data gets uploaded to Redshift, undergoes further transformation and gets loaded to normalized fact and dimension tables using a series of reusable tasks that allow for easy backfills. Finally, data checks are run against the data in the fact and dimension tables so as to catch any discrepancies that might be found in the data.",
    "first-project-tools": "<strong>Language:</strong> Python 2.7<br><strong>Tools:</strong> Apache Spark, Apache Airflow, Amazon Redshift and Amazon S3.",
    "second-project-title": "<strong>MovieBuff-API</strong>",
    "second-project-text": "I Developed an API in Python that allows users to create, view and update their list of favorite movies. I created it using Python Flask, integrated it with both MongoDB and Postgres, implemented an ORM framework SQLAlchemy, and set up continuous deployment of the API on Heroku.",
    "second-project-tools": "<strong>Language:</strong> Python 3.7<br><strong>Tools:</strong> Python Flask, MongoDB, Postgres, SQLAlchemy.",
    "third-project-title": "<strong>EpisodeTracker-API</strong>",
    "third-project-text": "Episode Tracker is an API I built that enables the user to be able to keep track of the TV Shows they are watching. They are able to search for TV Shows, view details of the shows and their episodes as well as log the episodes they have watched, They also able to tag their favourite shows and are able to get suggestions of similar shows.",
    "third-project-tools": "<strong>Language:</strong> Python 3.6<br><strong>Tools:</strong> Django 2.0.5, Docker."


}